
{
  "problem_statement": {
    "title": "AI-Based Timetable Generation System aligned with NEP 2020 for Multidisciplinary Education Structures",
    "description": {
      "background": "With the implementation of the National Education Policy (NEP) 2020, all higher education institutions—including Institutes of Teacher Education and general degree colleges—have transitioned to Four-Year Undergraduate Programmes (FYUP) and integrated teacher education programs like B.Ed., M.Ed., and ITEP. These programs feature flexible, credit-based, multidisciplinary structures allowing students to choose Major, Minor, Skill-Based, Ability Enhancement, and Value-Added courses. Manual timetable creation under this new framework has become extremely complex, involving numerous subject combinations, varying credit hours, student preferences, and faculty workload distribution. To manage this, colleges usually form dedicated timetable committees, but even then, clashes, underutilization of faculty, and scheduling inefficiencies persist.",
      "description": "This problem statement envisions the development of a web-based or hybrid intelligent system that can generate automated, conflict-free, optimized academic timetables alignment with the NEP 2020 course structure. The system must integrate:\n- Student data (elective choices, enrolled credits)\n- Curriculum structure (course codes, credits, theory/practical split)\n- Faculty workload, availability, and expertise\n- Room/lab availability and capacity\n- Teaching practice schedules (especially relevant for B.Ed. and M.Ed.)\n- Field work, internships, and project components"
    },
    "expected_solution": {
      "overview": "A deployable AI/ML-assisted Timetable Generator that:",
      "features": [
        "Accepts structured inputs from academic, student, and faculty databases",
        "Generates a semester-wise timetable for multiple programs (B.Ed., M.Ed., FYUP, ITEP)",
        "Prevents scheduling conflicts across faculty and infrastructure",
        "Accommodates future course additions and changing NEP guidelines",
        "Offers exportable formats (PDF, Excel) for student and faculty sharing",
        "Can be integrated with existing Academic Management Systems",
        "The system should also allow dynamic editing, scenario simulation, and scalability for upcoming semesters. A user-friendly admin interface is essential to allow real-time inputs and updates."
      ]
    },
    "organization": "Government of Jammu and Kashmir",
    "department": "Higher Education Department",
    "category": "Software",
    "theme": "Smart Automation"
  }
}
